{
  "backend/main.mo": "Motoko canister implementing user profile, favorites, and playlist management with access control checks.",
  "feature_evidence.json": "Feature evidence report mapping features to files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend source files.",
  "frontend/android-wrapper/app/build.gradle": "Gradle config for the Android wrapper app including SDK versions and dependencies.",
  "frontend/android-wrapper/app/src/main/AndroidManifest.xml": "Android manifest defining permissions, app metadata, and MainActivity entry point.",
  "frontend/android-wrapper/app/src/main/assets/README.txt": "Instructions for placing the built web app assets into the Android wrapper.",
  "frontend/android-wrapper/app/src/main/java/com/nothingplayer/offlinewrapper/MainActivity.kt": "MainActivity that configures a WebView and loads the offline bundled web app from assets.",
  "frontend/android-wrapper/build.gradle": "Project-level Gradle configuration and plugin setup for the Android wrapper.",
  "frontend/android-wrapper/README.md": "Documentation for the Android WebView wrapper that loads the bundled offline web app.",
  "frontend/android-wrapper/settings.gradle": "Gradle settings defining repositories and including the app module.",
  "frontend/BUILD.md": "Build guide for producing the offline Android APK version of the app.",
  "frontend/index.css": "Tailwind-based global styles defining color variables and light/dark themes.",
  "frontend/index.html": "HTML entry point referencing the manifest, icons, and main script for the web app.",
  "frontend/public/manifest.webmanifest": "PWA manifest specifying app metadata, icons, theme colors, and display mode.",
  "frontend/public/sw.js": "Service worker that caches static assets and audio, cleans old caches, and serves cached responses with fallback to network.",
  "frontend/src/App.tsx": "Main app component wiring player, library, header, profile setup, and service worker registration.",
  "frontend/src/components/auth/AuthGateNotice.tsx": "Displays sign‑in or offline notice when user lacks identity.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button managing Internet Identity auth and query cache reset.",
  "frontend/src/components/auth/ProfileSetupDialog.tsx": "Dialog that collects and saves a user’s display name on first login.",
  "frontend/src/components/header/Header.tsx": "Header showing app title, install prompt, user name, login button, and offline notice.",
  "frontend/src/components/layout/SectionCard.tsx": "Simple styled container wrapper for section content.",
  "frontend/src/components/library/LibrarySection.tsx": "Library view managing favorites, playlists, migrations, ordering, and track interactions.",
  "frontend/src/components/library/PlaylistManager.tsx": "Controls playlist creation, selection, renaming, and deletion via dialogs and menus.",
  "frontend/src/components/library/PlaylistReorderControls.tsx": "Up/down buttons enabling reordering of playlist tracks.",
  "frontend/src/components/library/TrackRow.tsx": "Renders a track row with play controls, metadata, favorite and playlist toggles based on props.",
  "frontend/src/components/offline/OfflineNotice.tsx": "Displays an alert notifying the user they are offline with limited functionality.",
  "frontend/src/components/player/PlaybackModes.tsx": "Provides shuffle and repeat mode toggle buttons for the audio player.",
  "frontend/src/components/player/PlayerSection.tsx": "Main player UI with transport controls, seek bar, volume, playback modes, and error handling.",
  "frontend/src/components/pwa/InstallAppEntry.tsx": "Handles PWA install flow with install button and fallback instructions dialog.",
  "frontend/src/config/canisterResolution.ts": "Selects backend canister host and ID based on environment, with fallbacks for production and local.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating queries when it changes.",
  "frontend/src/hooks/useAudioPlayer.ts": "Implements full audio player logic including playback, track loading, progress, volume, shuffle, and repeat.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and logic for Internet Identity authentication, login, logout, and identity persistence.",
  "frontend/src/hooks/useNetworkStatus.ts": "Tracks online/offline network status using browser events.",
  "frontend/src/hooks/usePwaInstall.ts": "Provides a hook to detect PWA install availability, track installation state, and trigger the install prompt.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for loading and saving user profile, favorites, and playlists via an actor with offline checks.",
  "frontend/src/index.css": "Sets up Tailwind base styles and custom Nothing-style color variables plus utility backgrounds.",
  "frontend/src/lib/tracks.ts": "Defines track types, sample track data, and helpers for lookup and time formatting.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the app's design system.",
  "project_state.json": "Contains project metadata, features, known issues, and architectural notes for the music player app."
}